# Pandasüêº

In [1]:
import pandas as pd # pd estamos apelidando

# DataFrame

In [ ]:
dados = {
    "Nome": ["Alice", "Bob", "Carlos"],
    "Idade": [25, 30, 22],
    "Cidade": ["S√£o Paulo", "Rio de Janeiro", "Belo Horizonte"]
}



dtf = pd.DataFrame(dados)
display(dtf)
# vendo a dimens√£o
print(f"Essa tabela tem {dtf.ndim} dimens√µes")

     Nome  Idade          Cidade
0   Alice     25       S√£o Paulo
1     Bob     30  Rio de Janeiro
2  Carlos     22  Belo Horizonte

Essa tabela tem 2 dimens√µes

## Par√¢metros  do DataFrame(data, index, columns, dtype)

## Explorando o par√¢metro data
*    Para o dataframe o parametro **data** pode receber varios tipos como por exemplo:
        * Lista
        * dicionario
        * DataFrame existente tamb√©m

## Exemplo com lista

In [3]:
list = ["Paulo", "Sandro", "Frederico"]
dtf2 = pd.DataFrame(list, columns = ["Nomes"])
dtf2

       Nomes
0      Paulo
1     Sandro
2  Frederico

## Exemplo com Dicion√°rio

In [4]:
dict = {
    "Nomes":list, # Praticamente so peguei os valores que est√£o na variavel lista
    "Idades":[12,20,20]
}

dft3 = pd.DataFrame(dict)
dft3

       Nomes  Idades
0      Paulo      12
1     Sandro      20
2  Frederico      20

## Exemplo com um DataFrame existente

In [5]:
dft4 = pd.DataFrame(dft3)
dft4 # resultado

       Nomes  Idades
0      Paulo      12
1     Sandro      20
2  Frederico      20

# Atributo index
*   Ela serve para acender ou mudar os "ids" de uma linha inteira onde ela pode receber lista ou numeros

### Sintaxe: index = [srings] or index = [numbers]

In [ ]:
# exemplo com string:

dados_index = pd.DataFrame(dados, index = ["a", "b", "c"])
print(dados_index)

     Nome  Idade          Cidade
a   Alice     25       S√£o Paulo
b     Bob     30  Rio de Janeiro
c  Carlos     22  Belo Horizonte

In [14]:
# exemplo com numeros
dados_index2 = pd.DataFrame(dados, index = [10, 20, 30])
print(dados_index2)

      Nome  Idade          Cidade
10   Alice     25       S√£o Paulo
20     Bob     30  Rio de Janeiro
30  Carlos     22  Belo Horizonte